import { Box } from "@mui/material";
import Header from "./Header";
import Section from "./Section";
import InfoSection from "./InfoSection";
import image1 from '../images/1.png';
import image2 from '../images/2.png';

function Dashboard() {

  return (
    <Box margin="30px 30px 30px 30px " >
      <Header/> 
      <Box margin={"50px 120px 50px 120px"}>

       <Section 
        title="مقدمه"
        text1="دیجیتال ساینیج (Digital Signage) یا تابلو اعلانات دیجیتال یک فناوری نرم افزاری است که برای مدیریت محتوای نمایشگرهای الکترونیکی مانند LCD، LED، OLED، تلویزیون های شهری و ویدیو پروژکتورها استفاده میشود و قابلیت نمایش انواع محتوای دیجیتال شامل تصاویر، ویدیوها، اطلاعات متنی و تبلیغات در فضاهای عمومی و خصوصی را فراهم میسازد. اجزای اصلی این سامانه شامل سیستم مدیریت محتوا یا CMS، پخش‌کننده‌های رسانه یا Media Players و نمایشگرها هستند که توسط اینترنت یا شبکه داخلی به همدیگر متصل شده و تمامی کارهای طراحی و دریافت و به‌روزرسانی محتوا را انجام میدهند"
        text2="نرم‌افزار برنا رسانه، به عنوان دیجیتال ساینیج ایرانی محصول شرکت برنا گستران دانش، ابزاری قدرتمند برای ایجاد محتوا و چیدمان‌های تصویری مختلف است که به کاربران این امکان را می‌دهد با استفاده از ماژول‌های مختلف مانند عکس، ویدیو و روزنامه و... محتواهای جذابی را بسازند و روی نمایشگرهای خود نمایش دهند"
      />

      <InfoSection 
        title="صفحه اصلی"
        description="در این صفحه آمار و اطلاعات مهم نرم افزار نمایش داده می شود"
        details={[
          { label: 'نمایشگرهای روشن', value: 'تعداد نمایشگر های آنلاین را نمایش می دهد' },
          { label: 'فایل ها', value: 'تعداد فایل‌های آپلود شده در سرور را نمایش می دهد' },
          { label: 'پهنای باند مصرفی', value: 'میزان مصرف پهنای باند شبکه در ارتباط نمایشگرها و سرور را نمایش می دهد' },
          { label: 'کاربران', value: 'تعداد کاربران تعریف شده در سامانه را نمایش می دهد' },
          { label: 'حجم کتابخانه', value: 'حجم کل فایل‌های آپلود شده را نمایش می دهد' },
          { label: 'چیدمان', value: 'تعداد چیدمان‌های طراحی شده را نمایش می دهد' },
        ]}
        image={image1}
        height="90px"
      />
      <Section 
        title="محل نمایشگرها"
        text1="جانمایی نمایشگرها روی نقشه همراه با نمایش وضعیت آنلاین یا آفلاین بودن هر نمایشگر. اگر نمایشگر ها فعال باشند با رنگ سبز و اگر نباشند با رنگ قرمز نمایش داده می شود"
      />
      <InfoSection 
        title="آخرین تصویر نمایشگرها"
        description="آخرین چیزی که روی نمایشگرها در حال نمایش است با درج نام صفحه نمایش به صورت اسلایدر نمایش داده می شود"
        details={[
          { label: 'پهنای باند استفاده شده', value: 'میزان پهنای باند استفاده شده روزانه را نمایش می دهد' },
          { label: 'میزان حجم کتابخانه', value: 'حجم انواع فایلهای موجود در کتابخانه به درصد نمایش داده میشود' },
          { label: 'وضعیت نمایشگر ها', value: 'تعداد نمایشگر های روشن و خاموش از کل نمایشگرها را نمایش میدهد' },
          { label: 'کاربران آنلاین', value: 'کاربرانی که در حال حاضر به صورت آنلاین در حال استفاده از نرم افزار هستند را نمایش می دهد' },
          { label: 'مناسبت های 30 روز آینده', value: 'مناسبت های تقویمی یک ماه آینده در این قسمت نمایش داده می شود ' },
          { label: 'هشدارهای نمایشگرها', value: 'اعلان ها و خطاهای نمایشگرها را برای اطلاع از آخرین وضعیت آنها نمایش می دهد' },
        ]}
        image={image2}
        height="800px"
      />

       {/* <Section 
        title=""
        text1=""
        text2=""
      />
      <Process
        title=""
        content={[
          { description: "", image: image ,height:"200px"},
          { description: "", image: image ,height:"200px"},
          { description: "", image: image ,height:"200px"},
          { description: "", image: image ,height:"200px"},
          { description: "", image: image ,height:"200px"},
          { description: "", image: image ,height:"200px"},
          { description: "", image: image ,height:"200px"},
        ]}
      />
      <InfoSection 
        title=""
        description=""
        details={[
          { label: '', value: '' },
          { label: '', value: '' },
          { label: '', value: '' },
          { label: '', value: '' },
          { label: '', value: '' },
          { label: '', value: '' },
        ]}
        image={image}
        height="300px"
      /> */}
      </Box>
     </Box>
  );
}

export default Dashboard;
