import { Box } from "@mui/material";
import Header from "./Header";
import Section from "./Section";
// import InfoSection from "./InfoSection";
import Process from "./Process";
import image from '../images/0.png';

function Time() {

  return (
    <Box margin="30px 30px 30px 30px " >
      <Header/> 
      <Box margin={"50px 120px 50px 120px"}>

      <Section 
        title="جدول زمانی"
        text1="مدیریت زمان بندی نمایش محتوا روی هر نمایشگر یا گروه نمایشگر‌ها در تاریخ و ساعت معین در این قسمت انجام میشود"
      />
      <Process
        title="ایجاد زمان بندی "
        content={[
          { description: "برای ایجاد زمان بندی پخش محتوا میتوانیم از دکمه زمان بندی جدید و یا کلیک روی تاریخ مورد نظر از روی تقویم اقدام کنیم. با این کار فرم ایجاد زمان بندی جدید باز میشود", image: image ,height:"400px"},
          { description: "ابتدا نمایشگر یا گروه نمایشگرهای مورد نظر برای زمانبندی را از لیست نمایشگر انتخاب میکنیم. سپس چیدمان یا زنجیره چیدمان را برای پخش انتخاب میکنیم", image: image ,height:"400px"},
          { description: "زمان شروع و پایان پخش محتوا را انتخاب کرده و اگر بخواهیم این زمان بندی در بازه های مختلف زمانی تکرار شود دوره و نوبت تکرار و در نهایت زمان پایان تکرار زمان بندی را تنظیم میکنیم", image: image ,height:"400px"},
          { description: "در قسمت جستجوی لیست نمایشگرها و گروه نمایشگرها میتوانیم با وارد کردن نام از بین موارد موجود جستجو انجام دهیم", image: image ,height:"400px"},
          { description: "با انتخاب هر نمایشگر یا گروه، زمان بندی های مربوط به آن مورد روی تقویم نمایش داده میشود", image: image ,height:"400px"},
          { description: "برای مشاهده و ویرایش زمان بندی های موجود یک نمایشگر یا گروه روی دکمه ویرایش کلیک میکنیم. با ورود به بخش ویرایش میتوانیم زمان بندی ها را حذف یا ویرایش کنیم", image: image ,height:"400px"},
          { description: "گزینه مناسبت های ماه جاری مناسبت های تاریخی مربوط به همان ماه انتخاب شده روی تقویم را نمایش میدهد. از این قسمت میتوانیم برای هر مناسبت زمان بندی پخش محتوای مربوط به آن مناسبت را برای پخش رو نمایشگر زمان بندی کنیم", image: image ,height:"400px"},
        ]}
      />

      </Box>
     </Box>
  );
}

export default Time;
